Para poder efectuar el EDA, vamos a unir los 7 archivos trabajados en un solo archivo.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt

In [2]:
dfbalancefinal = pd.read_csv('df_balance.csv')

In [3]:
dfbalancefinal.head(3)

    cliente_id  t_id  balance_prev  balance_post
0  C1231006815     0      170136.0     160296.36
1  M1979787155     0           0.0          0.00
2  C1666544295     1       21249.0      19384.72

In [4]:
dfbalancefinal.shape

(12725240, 4)

In [5]:
dfbalancefinal.duplicated(subset=['cliente_id', 't_id']).value_counts()

False    12725240
dtype: int64

In [6]:
df_cuantia = pd.read_csv('df_cuantia.csv')

In [7]:
df_cuantia.sample(3)

            t_id    cuantia
3679710  3679710  156549.75
2801547  2801547  265552.92
5777183  5777183    4338.30

In [8]:
df_cuantia.shape

(6362620, 2)

In [9]:
df_cuantia.duplicated(subset=['t_id']).value_counts()

False    6362620
dtype: int64

In [10]:
df_clientes = pd.read_csv('df_clientes.csv')

In [11]:
df_clientes.head(3)

   t_id id_cliente_origen id_cliente_destino
0     0       C1231006815        M1979787155
1     1       C1666544295        M2044282225
2     2       C1305486145         C553264065

In [12]:
df_clientes.shape

(6362620, 3)

In [13]:
df_clientes.duplicated(subset=['t_id']).value_counts()

False    6362620
dtype: int64

Uni√≥n dataset balance y dataset clientes

In [14]:
clientes_origen = df_clientes[['t_id', 'id_cliente_origen']]

In [15]:
clientes_origen = clientes_origen.rename(columns={'id_cliente_origen':'cliente_id'
                                   })

In [16]:
df_balance_clientes_origen =  pd.merge(dfbalancefinal ,clientes_origen, how = 'inner', on = ('t_id', 'cliente_id'))

In [17]:
df_balance_clientes_origen_1 = df_balance_clientes_origen.rename(columns={'cliente_id':'id_cliente_origen','balance_prev':'balance_prev_origen','balance_post':'balance_post_origen'  })

In [18]:
df_balance_clientes_origen_1.shape

(6362620, 4)

In [19]:
df_balance_clientes_origen_1.head(5)

  id_cliente_origen  t_id  balance_prev_origen  balance_post_origen
0       C1231006815     0             170136.0            160296.36
1       C1666544295     1              21249.0             19384.72
2       C1305486145     2                181.0                 0.00
3        C840083671     3                181.0                 0.00
4       C2048537720     4              41554.0             29885.86

In [20]:
df_balance_clientes_origen_1.duplicated(subset=['t_id']).value_counts()

False    6362620
dtype: int64

In [21]:
clientes_destino = df_clientes[['t_id', 'id_cliente_destino']]

In [22]:
clientes_destino = clientes_destino.rename(columns={'id_cliente_destino':'cliente_id'
                                   })

In [23]:
df_balance_clientes_destino =  pd.merge(dfbalancefinal ,clientes_destino, how = 'inner', on = ('t_id', 'cliente_id'))

In [24]:
df_balance_clientes_destino_1 = df_balance_clientes_destino.rename(columns={'cliente_id':'id_cliente_destino','balance_prev':'balance_prev_destino','balance_post':'balance_post_destino'  })

In [25]:
df_balance_clientes_destino_1.head(5)

  id_cliente_destino  t_id  balance_prev_destino  balance_post_destino
0        M1979787155     0                  0.00                  0.00
1        M2044282225     1                  0.00                  0.00
2         C553264065     2                  0.00                  0.00
3         C553264065  6167                  0.00             109985.65
4         C553264065  7903             109985.65              99729.44

In [26]:
df_balance_clientes_destino_1.duplicated(subset=['t_id']).value_counts()

False    6362620
dtype: int64

In [27]:
df_balance_clientes =  pd.merge(df_balance_clientes_origen_1,df_balance_clientes_destino_1, how = 'inner', on = ('t_id'))

In [28]:
df_balance_clientes.shape

(6362620, 7)

In [29]:
df_balance_clientes.duplicated(subset=['t_id']).value_counts()

False    6362620
dtype: int64

In [30]:
df_balance_clientes.head(10)

,id_cliente_origen,t_id,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino
0,C1231006815,0,170136.00,160296.36,M1979787155,0.0,0.00
1,C1666544295,1,21249.00,19384.72,M2044282225,0.0,0.00
2,C1305486145,2,181.00,0.00,C553264065,0.0,0.00
3,C840083671,3,181.00,0.00,C38997010,21182.0,0.00
4,C2048537720,4,41554.00,29885.86,M1230701703,0.0,0.00
5,C90045638,5,53860.00,46042.29,M573487274,0.0,0.00
6,C154988899,6,183195.00,176087.23,M408069119,0.0,0.00
7,C1912850431,7,176087.23,168225.59,M633326333,0.0,0.00
8,C1265012928,8,2671.00,0.00,M1176932104,0.0,0.00
9,C712410124,9,41720.00,36382.23,C195600860,41898.0,40348.79

In [31]:
df_balance_clientes_1 = df_balance_clientes[['t_id','id_cliente_origen','balance_prev_origen','balance_post_origen',
                                             'id_cliente_destino','balance_prev_destino','balance_post_destino']]

Unimos el dataset que ahora tiene el balance de origen y destino con su transacci√≥n, con la cuant√≠a de la transacci√≥n

In [32]:
df_balance_clientes_cuantia =  pd.merge(df_balance_clientes_1 ,df_cuantia, how = 'inner', on = ('t_id'))

In [33]:
df_balance_clientes_cuantia.head(10)

,t_id,id_cliente_origen,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino,cuantia
0,0,C1231006815,170136.00,160296.36,M1979787155,0.0,0.00,9839.64
1,1,C1666544295,21249.00,19384.72,M2044282225,0.0,0.00,1864.28
2,2,C1305486145,181.00,0.00,C553264065,0.0,0.00,181.00
3,3,C840083671,181.00,0.00,C38997010,21182.0,0.00,181.00
4,4,C2048537720,41554.00,29885.86,M1230701703,0.0,0.00,11668.14
5,5,C90045638,53860.00,46042.29,M573487274,0.0,0.00,7817.71
6,6,C154988899,183195.00,176087.23,M408069119,0.0,0.00,7107.77
7,7,C1912850431,176087.23,168225.59,M633326333,0.0,0.00,7861.64
8,8,C1265012928,2671.00,0.00,M1176932104,0.0,0.00,4024.36
9,9,C712410124,41720.00,36382.23,C195600860,41898.0,40348.79,5337.77

In [34]:
df_balance_clientes_cuantia.shape

(6362620, 8)

Cargamos el dataset tipo y unimos con el dataset que tiene los datos del balance y de la cuant√≠a

In [35]:
df_tipo = pd.read_csv('df_tipo.csv')

In [36]:
df_tipo.shape

(6362620, 2)

In [37]:
df_balance_tipo =  pd.merge(df_balance_clientes_cuantia ,df_tipo, how = 'inner', on = ('t_id'))

In [38]:
df_balance_tipo.shape

(6362620, 9)

In [39]:
df_balance_tipo.head(5)

,t_id,id_cliente_origen,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino,cuantia,tipo
0,0,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,9839.64,PAYMENT
1,1,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,1864.28,PAYMENT
2,2,C1305486145,181.0,0.00,C553264065,0.0,0.0,181.00,TRANSFER
3,3,C840083671,181.0,0.00,C38997010,21182.0,0.0,181.00,CASH_OUT
4,4,C2048537720,41554.0,29885.86,M1230701703,0.0,0.0,11668.14,PAYMENT

Cargamos el dataset tiempo y unimos con el dataset que tiene los datos del balance, de la cuant√≠a de la trancci√≥n y su tipo

In [40]:
df_tiempo = pd.read_csv('df_tiempo.csv')

In [41]:
df_tiempo.shape

(6362620, 2)

In [42]:
df_balance_tiempo =  pd.merge(df_balance_tipo ,df_tiempo, how = 'inner', on = ('t_id'))

In [43]:
df_balance_tiempo.shape

(6362620, 10)

In [44]:
df_balance_tiempo.head(5)

,t_id,id_cliente_origen,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino,cuantia,tipo,fecha_final
0,0,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,9839.64,PAYMENT,2022-09-01 08:00:00
1,1,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,1864.28,PAYMENT,2022-09-01 08:00:00
2,2,C1305486145,181.0,0.00,C553264065,0.0,0.0,181.00,TRANSFER,2022-09-01 08:00:00
3,3,C840083671,181.0,0.00,C38997010,21182.0,0.0,181.00,CASH_OUT,2022-09-01 08:00:00
4,4,C2048537720,41554.0,29885.86,M1230701703,0.0,0.0,11668.14,PAYMENT,2022-09-01 08:00:00

Cargamos el dataset alarma_fraude y unimos con el dataset que tiene los datos del balance, de la cuant√≠a de la trancci√≥n,
su tipo y tiempo.

In [45]:
df_alarma = pd.read_csv('df_alarma_fraude.csv')

In [46]:
df_alarma.shape

(16, 2)

In [47]:
df_alarma.head(5)

      t_id    mensaje_alarma
0  2736446  Detectado_fraude
1  3247297  Detectado_fraude
2  3760288  Detectado_fraude
3  5563713  Detectado_fraude
4  5996407  Detectado_fraude

In [48]:
df_balance_alarma = pd.merge(df_balance_tiempo ,df_alarma, how = 'left', on = ('t_id'))

In [49]:
df_balance_alarma.shape

(6362620, 11)

In [50]:
df_balance_alarma.sample(5)

,t_id,id_cliente_origen,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino,cuantia,tipo,fecha_final,mensaje_alarma
5534511,5532272,C371163578,0.00,0.00,M78093917,0.00,0.00,11554.81,PAYMENT,2022-09-17 04:00:00,NaN
4818958,4815281,C52467249,0.00,0.00,C1471541275,297020.39,298951.61,1931.22,CASH_OUT,2022-09-15 17:00:00,NaN
6221366,6220946,C1785293540,255587.26,245702.68,M1376488597,0.00,0.00,9884.59,PAYMENT,2022-09-25 21:00:00,NaN
5961665,5960506,C1789523267,0.00,0.00,M27056169,0.00,0.00,14456.41,PAYMENT,2022-09-18 05:00:00,NaN
1727599,1723462,C728864301,1355.00,0.00,M928837742,0.00,0.00,2326.71,PAYMENT,2022-09-07 23:00:00,NaN

Chequeamos una transacci√≥n donde salt√≥ la alarma de fraude

In [51]:
a = df_balance_alarma.loc[df_balance_alarma['t_id'] == 2736446]

In [52]:
a

,t_id,id_cliente_origen,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino,cuantia,tipo,fecha_final,mensaje_alarma
2741452,2736446,C728984460,4953893.08,4953893.08,C639921569,0.0,0.0,4953893.08,TRANSFER,2022-09-10 03:00:00,Detectado_fraude

Cargamos el dataset es_fraude y unimos con el dataset que tiene los datos del balance, de la cuant√≠a de la trancci√≥n,
su tipo, tiempo y si se detecto la alarma de fraude.

In [55]:
df_fraude = pd.read_csv('df_es_fraude.csv')

In [56]:
df_fraude.shape

(6362520, 2)

In [57]:
df_fraude.head(5)

   t_id  es_fraude
0     0      False
1     1      False
2     2       True
3     3       True
4     4      False

In [58]:
df_balance_fraude = pd.merge(df_balance_alarma ,df_fraude, how = 'left', on = ('t_id'))

In [59]:
df_balance_fraude.shape

(6362620, 12)

In [60]:
df_balance_fraude.head(5)

,t_id,id_cliente_origen,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino,cuantia,tipo,fecha_final,mensaje_alarma,es_fraude
0,0,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,9839.64,PAYMENT,2022-09-01 08:00:00,NaN,False
1,1,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,1864.28,PAYMENT,2022-09-01 08:00:00,NaN,False
2,2,C1305486145,181.0,0.00,C553264065,0.0,0.0,181.00,TRANSFER,2022-09-01 08:00:00,NaN,True
3,3,C840083671,181.0,0.00,C38997010,21182.0,0.0,181.00,CASH_OUT,2022-09-01 08:00:00,NaN,True
4,4,C2048537720,41554.0,29885.86,M1230701703,0.0,0.0,11668.14,PAYMENT,2022-09-01 08:00:00,NaN,False

In [63]:
df_transacciones = df_balance_fraude[['t_id','tipo','fecha_final','id_cliente_origen','balance_prev_origen','balance_post_origen','id_cliente_destino','balance_prev_destino',
                                      'balance_post_destino','cuantia', 'mensaje_alarma','es_fraude']]

In [64]:
df_transacciones.shape

(6362620, 12)

In [65]:
df_transacciones.sample(5)

,t_id,tipo,fecha_final,id_cliente_origen,balance_prev_origen,balance_post_origen,id_cliente_destino,balance_prev_destino,balance_post_destino,cuantia,mensaje_alarma,es_fraude
4867096,4863516,CASH_OUT,2022-09-15 19:00:00,C1225730105,0.0,0.0,C1307958375,1799069.66,2089221.75,290152.09,NaN,False
4212618,4208088,CASH_OUT,2022-09-14 00:00:00,C690878393,0.0,0.0,C24132352,3330918.46,3650242.04,319323.57,NaN,False
5889798,5888412,CASH_OUT,2022-09-18 02:00:00,C759086997,11581.0,0.0,C382179335,1124814.64,1159010.79,34196.15,NaN,False
2913094,2908055,CASH_OUT,2022-09-10 19:00:00,C701528038,19859.0,0.0,C1756661753,5624.47,56116.41,50491.94,NaN,False
5050816,5047576,CASH_OUT,2022-09-16 01:00:00,C692221494,0.0,0.0,C1549030630,2366046.87,2586321.85,220274.98,NaN,False

In [66]:
df_transacciones.duplicated(subset=[ 't_id']).value_counts()

False    6362620
dtype: int64

In [67]:
df_transacciones.to_csv('df_transacciones.csv', index = False)